[{"bio": "Matthew Rocklin likes numerics, mathematics, and programming paradigms. He contributes to a variety of open source projects and endeavors to demonstrate the value of abstract solutions to concrete problems. A graduate of UC Berkeley (Physics, Math) and of the University of Chicago (PhD in CS). Matthew is currently a Computational Scientist at Continuum Analytics.", "twitter": "mrocklin", "organisation": "Continuum Analytics", "name": "Rocklin", "firstname": "Matthew", "title": "", "track": "both", "abstract": "", "linkedin": "https://www.linkedin.com/pub/matthew-rocklin/23/b43/461", "time": "10:00:00 AM", "date": "5/29/2015", "type": "keynote", "id": "rocklin_0"}, {"bio": "Felix Wick leads the machine learning and core development team at Blue Yonder, a SaaS provider for predictive applications. He obtained his diploma (2008) and PhD (2011) in physics at the Karlsruhe Institute of Technology (KIT). The topic of his research was experimental particle physics with a focus on statistical data analysis. In 2011, he joined Blue Yonder as Data Scientist, building predictive analytics solutions for various customer projects. He now focuses on the development of machine learning and data science algorithms primarily based on Python.", "twitter": "", "organisation": "Blue Yonder", "name": "Wick", "firstname": "Felix", "title": "", "track": "both", "abstract": "", "linkedin": "https://www.linkedin.com/pub/felix-wick/79/b3/b73", "time": "4:00:00 PM", "date": "5/29/2015", "type": "keynote", "id": "wick_0"}, {"bio": "Trent McConaghy, PhD has been doing machine learning (ML) research since the mid 90s. He co-founded ascribe GmbH, which enables copyright protection via internet-scale ML and the blockchain. Before that, he co-founded Solido where he applied ML to circuit design; the majority of big semis now use Solido. Before that, he co-founded ADA also doing ML + circuits; it was acquired in 2004. Before that he did ML research at the Canadian Department of Defense. He has written two books and 50 papers+patents on ML. He co-organizes the Berlin ML meetup. He keynoted Data Science Day Berlin 2014, gave an invited talk at PyData Berlin 2014, and more.", "twitter": "trentmc0", "organisation": "ascribe", "name": "McConaghy", "firstname": "Trent", "title": "Rewiring the Internet for Ownership with Big Data and Blockchains", "track": "both", "abstract": "When it comes to ownership, the internet is broken. Artists, designers, and other creatives can share their work easily on the internet, but keeping it as \"theirs\" and get fairly compensated has proven difficult. How do you \"own\" something when bits can be copied freely? It turns out that visionaries of hypertext foresaw this issue in the 60s. They even proposed systems to handle this. However, those systems were too complex and hard to build. By the early 90s, the simpler WWW had won, but unfortunately in its simplicity it left out attribution to owners. We ask a new question: can we retrofit the internet for ownership? It turns out the answer is yes, with the help of python-powered big data, machine learning, and the blockchain. First, we crawl the internet and create a large scale crawl database, then preprocess all media into machine learning features. Then, creators can \"register\" their work onto the blockchain. Finally, we use machine learning to cross-reference registered works against the large-scale crawl database. We can do this for images, text, and even 3d designs; and it works even if the design has changed meaningfully. Python-powered big data is making it possible to revive the dream of ownership on the internet.", "linkedin": "https://de.linkedin.com/in/trentmc", "time": "4:00:00 PM", "date": "5/29/2015", "type": "keynote", "id": "mcconaghy_0"}, {"bio": "", "twitter": "", "organisation": "", "name": "Lanzani", "firstname": "Giovanni", "title": "Embarrassingly parallel database calls with Python", "track": "expert", "abstract": "Have you ever squeezed you SQL queries to the last millisecond, but still found yourself with not enough speed in your data­driven Python applications? Then this talk is for you. We’ll look at how to shard your data, which design changes should happen and how to use the Python threading module to bring in the data as quickly as possible by making parallel database calls.", "linkedin": "", "time": "2:00:00 PM", "date": "5/29/2015", "type": "talk", "id": "lanzani_0"}]