[{"bio": "Matthew Rocklin likes numerics, mathematics, and programming paradigms. He contributes to a variety of open source projects and endeavors to demonstrate the value of abstract solutions to concrete problems. A graduate of UC Berkeley (Physics, Math) and of the University of Chicago (PhD in CS). Matthew is currently a Computational Scientist at Continuum Analytics.", "twitter": "mrocklin", "organisation": "Continuum Analytics", "name": "Rocklin", "firstname": "Matthew", "title": "How to get Data Science Models into production on a budget", "track": "both", "abstract": "Abstract_Rocklin", "linkedin": "https://www.linkedin.com/pub/matthew-rocklin/23/b43/461", "time": "10:00:00 AM", "date": "5/29/2015", "type": "keynote", "id": "rocklin_0"}, {"bio": "Felix Wick leads the machine learning and core development team at Blue Yonder, a SaaS provider for predictive applications. He obtained his diploma (2008) and PhD (2011) in physics at the Karlsruhe Institute of Technology (KIT). The topic of his research was experimental particle physics with a focus on statistical data analysis. In 2011, he joined Blue Yonder as Data Scientist, building predictive analytics solutions for various customer projects. He now focuses on the development of machine learning and data science algorithms primarily based on Python.", "twitter": "", "organisation": "Blue Yonder", "name": "Wick", "firstname": "Felix", "title": "Title_Wick", "track": "both", "abstract": "Abstract_Wick", "linkedin": "https://www.linkedin.com/pub/felix-wick/79/b3/b73", "time": "4:00:00 PM", "date": "5/29/2015", "type": "keynote", "id": "wick_0"}, {"bio": "", "twitter": "", "organisation": "", "name": "Lanzani", "firstname": "Giovanni", "title": "Embarrassingly parallel database calls with Python", "track": "expert", "abstract": "Have you ever squeezed you SQL queries to the last millisecond, but still found yourself with not enough speed in your data­driven Python applications? Then this talk is for you. We’ll look at how to shard your data, which design changes should happen and how to use the Python threading module to bring in the data as quickly as possible by making parallel database calls.", "linkedin": "", "time": "2:00:00 PM", "date": "5/29/2015", "type": "talk", "id": "lanzani_0"}]